# for name in ["철수", "영희", "길동", "유신"]:
#     print(name)

# for i in [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]:
#     print(i, end=" ")
# print(" ")

# for i in range(0,10,1):
#     print(i, end=" ")
# print(" ")

# for i in range(0,10,2):
#     print(i, end=" ")
# print(" ")

# for i in range(0):
#     print(i)

# for i in "abcedf":
#     print(i, end=" ")

# ------------------------------------
# print("안녕하세요")
# print("안녕하세요")
# print("안녕하세요")
# print("안녕하세요")
# print("안녕하세요")
# ------------------------------------

# ------------------------------------
# for i in [0, 1, 2, 3, 4]:
#     print("안녕하세요")
# ------------------------------------

# ------------------------------------
# for i in range(100):
#     print(i, "안녕하세요")

# print(type(range(5)))
# ------------------------------------

# ------------------------------------
# s = ["AAA", "BBB", "CCC", "DDD", "EEE"]
# for name in s:
#     print(name, "님", end =" ")
# ------------------------------------


